ErpTest/src/Catalogs/НаправленияДеятельности/НаправленияДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаправленияДеятельности</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыНаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетДоходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетЗатрат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетДенежныхСредствРаздельно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетДенежныхСредствПоКорреспонденции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВнеоборотныхАктивов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВариантОбособления</name>
    <type>
      <types>EnumRef.УдалитьВариантыОбособленияПоНаправлениюДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДСОпределяетсяВДокументе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНаправленияДеятельности</name>
    <type>
      <types>EnumRef.ТипыНаправленийДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемФинансированияКонтракта</name>
    <type>
      <types>DefinedType.ДенежноеПолеНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.ДенежноеПолеНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаМатериалы</name>
    <type>
      <types>DefinedType.ДенежноеПолеНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаОплатуТруда</name>
    <type>
      <types>DefinedType.ДенежноеПолеНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеПроизводственныеЗатраты</name>
    <type>
      <types>DefinedType.ДенежноеПолеНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщепроизводственныеЗатраты</name>
    <type>
      <types>DefinedType.ДенежноеПолеНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщехозяйственныеЗатраты</name>
    <type>
      <types>DefinedType.ДенежноеПолеНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческиеРасходы</name>
    <type>
      <types>DefinedType.ДенежноеПолеНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибыльКонтракта</name>
    <type>
      <types>DefinedType.ДенежноеПолеНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>УправленческиеРасходы</name>
    <type>
      <types>DefinedType.ДенежноеПолеНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопускаетсяОбособлениеСверхПотребности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКредитования</name>
    <type>
      <types>DefinedType.ДенежноеПолеНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентыПоКредитам</name>
    <type>
      <types>DefinedType.ДенежноеПолеНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйКонтракт</name>
    <type>
      <types>CatalogRef.ГосударственныеКонтракты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключенияКонтракта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтдельногоСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ErpTest/src/Catalogs/НаправленияДеятельности/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Статус.Пустая() Тогда
		Статус = Перечисления.СтатусыНаправленияДеятельности.Используется;
	КонецЕсли;
	
	ШаблонНазначения = Справочники.НаправленияДеятельности.ШаблонНазначения(ЭтотОбъект);
	Справочники.Назначения.ПроверитьЗаполнитьПередЗаписью(Назначение, ШаблонНазначения, ЭтотОбъект, "УчетЗатрат", Отказ, Истина, Не УчетЗатрат);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	Если Не ЭтоНовый() Тогда
		РеквизитыДоЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"ДопускаетсяОбособлениеСверхПотребности,ПометкаУдаления");
		
		ДополнительныеСвойства.Вставить("ПометкаУдаленияДоЗаписи", РеквизитыДоЗаписи.ПометкаУдаления);
		ДополнительныеСвойства.Вставить("ОбновитьНазначение", 
			РеквизитыДоЗаписи.ДопускаетсяОбособлениеСверхПотребности <> ДопускаетсяОбособлениеСверхПотребности);
	Иначе
		ДополнительныеСвойства.Вставить("ПометкаУдаленияДоЗаписи", Ложь);
		ДополнительныеСвойства.Вставить("ОбновитьНазначение", ДопускаетсяОбособлениеСверхПотребности);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонНазначения = Справочники.НаправленияДеятельности.ШаблонНазначения(ЭтотОбъект);
	Справочники.Назначения.ПриЗаписиСправочника(Назначение, 
												ШаблонНазначения,
												ЭтотОбъект,
												УчетНДСУП.ВидДеятельностиПоНалогообложениюНДС(НалогообложениеНДС),
												ДополнительныеСвойства.ОбновитьНазначение);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	ОбщегоНазначенияУТ.УстановитьПометкуУдаленияКлюча("Справочник.КлючиАналитикиУчетаПоПартнерам",
														Ссылка,
														ДополнительныеСвойства,
														ПометкаУдаления,
														ЭтоГруппа);
	
	//++ НЕ УТ
	ОбщегоНазначенияУТ.УстановитьПометкуУдаленияКлюча("Справочник.ПартииПроизводства",
														Ссылка,
														ДополнительныеСвойства,
														ПометкаУдаления,
														ЭтоГруппа);
	//-- НЕ УТ
	
	// Запись подчиненной константы.
	ОбеспечениеСервер.ИспользоватьУправлениеПеремещениемОбособленныхТоваровВычислитьИЗаписать();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если НалогообложениеНДСОпределяетсяВДокументе Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НалогообложениеНДС");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ЭтоГруппа Тогда
		Назначение = Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;
	
	ПараметрыЗаполнения = Справочники.НаправленияДеятельности.ПараметрыЗаполненияНалогообложениеНДСПродажи();
	УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(НалогообложениеНДС, ПараметрыЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		ПараметрыЗаполнения = Справочники.НаправленияДеятельности.ПараметрыЗаполненияНалогообложениеНДСПродажи();
		УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(НалогообложениеНДС, ПараметрыЗаполнения);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
